Revit 2027 API
FabricationPart.InsulationSpecification Property
 The fabrication part insulation specification identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int InsulationSpecification { get; set; }
Public Property InsulationSpecification As Integer
	Get
	Set
public:
property int InsulationSpecification {
	int get ();
	void set (int value);
}
member InsulationSpecification : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentException |  When setting this property: the insulation specification is invalid for the fabrication part.
InvalidOperationException |  -or- When setting this property: the fabrication part has taps connected. -or- When setting this property: the specification fails to be set by identifier: specId.
Remarks
 A value of 0 indicates the insulation specification is set to off.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace